{
  "Which 5 companies have the highest average engagement rate (Likes + Comments) per Facebook post? (CompanyFacebookDetail, CompanyInfo)": "SELECT TOP 5 ci.Name, AVG(cfd.Likes + cfd.Comments) AS AverageEngagement FROM CompanyFacebookDetail cfd JOIN CompanyInfo ci ON cfd.CompanyInfoId = ci.Id GROUP BY ci.Name ORDER BY AverageEngagement DESC;",
  "For the top vendor 'Leidos Holdings', what are the top 5 customer industries they have deals with? (CompanyDealMaster)": "SELECT TOP 5 CustomerIndustry, COUNT(Id) AS DealCount FROM CompanyDealMaster WHERE VendorParent = 'Leidos Holdings' GROUP BY CustomerIndustry ORDER BY DealCount DESC;",
  "What are the top 5 technologies used by companies headquartered in 'North America - Group I'? (CompanyInfo, CompanyTechStack, LookUpValue)": "SELECT TOP 5 cts.Technology, COUNT(cts.Id) AS UsageCount FROM CompanyTechStack cts JOIN CompanyInfo ci ON cts.CompanyInfoId = ci.Id JOIN LookUpValue l ON ci.Geography = l.Id WHERE l.Value = 'North America - Group I' GROUP BY cts.Technology ORDER BY UsageCount DESC;",
  "How many executives have a presence on both LinkedIn and Twitter? (CompanyManagementDetail)": "SELECT COUNT(Id) AS ExecutiveCount FROM CompanyManagementDetail WHERE LinkedinUrl IS NOT NULL AND TwitterUrl IS NOT NULL;",
  "What is the quarterly trend of deal signings for the vendor 'IBM'? (CompanyDealMaster)": "SELECT YEAR(SigningDate) AS DealYear, DATEPART(quarter, SigningDate) AS DealQuarter, COUNT(Id) AS DealCount FROM CompanyDealMaster WHERE VendorParent = 'IBM' GROUP BY YEAR(SigningDate), DATEPART(quarter, SigningDate) ORDER BY DealYear, DealQuarter;",
  "What is the average number of technologies used by companies of different employee sizes? (CompanyInfo, CompanyTechStack)": "SELECT TOP 10 ci.Employees AS EmployeeSize, AVG(CAST(TechCount.TechCount AS FLOAT)) AS AverageTechCount FROM CompanyInfo ci JOIN (SELECT CompanyInfoId, COUNT(Id) AS TechCount FROM CompanyTechStack GROUP BY CompanyInfoId) AS TechCount ON ci.Id = TechCount.CompanyInfoId WHERE ci.Employees IS NOT NULL GROUP BY ci.Employees ORDER BY ci.Employees;",
  "Who are the top 3 vendors for companies in the 'Healthcare' industry based on deal count? (CompanyDealMaster, CompanyInfo, LookUpValue)": "SELECT TOP 3 cdm.VendorParent, COUNT(cdm.Id) AS DealCount FROM CompanyDealMaster cdm JOIN CompanyInfo ci ON cdm.VendorId = ci.Id JOIN LookUpValue l ON ci.Industry = l.Id WHERE l.Value = 'Healthcare' GROUP BY cdm.VendorParent ORDER BY DealCount DESC;",
  "What are the most common section types for the top 5 companies with the most data entries? (SectionData, SectionInfo, CompanyInfo)": "SELECT TOP 5 ci.Name, si.SectionName, COUNT(sd.Id) AS SectionCount FROM SectionData sd JOIN SectionInfo si ON sd.SectionInfoId = si.Id JOIN CompanyInfo ci ON sd.CompanyInfoId = ci.Id WHERE ci.Id IN (SELECT TOP 5 CompanyInfoId FROM SectionData GROUP BY CompanyInfoId ORDER BY COUNT(Id) DESC) GROUP BY ci.Name, si.SectionName ORDER BY SectionCount DESC;",
  "For the top 5 executives with the most persona articles, what are their company and department? (PersonaMisc, PersonaUser, CompanyManagementDetail, CompanyInfo, LookUpValue)": "SELECT TOP 5 p.Name AS ExecutiveName, c.Name AS CompanyName, d.Value AS Department FROM PersonaMisc pm JOIN PersonaUser pu ON pm.PersonaUserId = pu.Id JOIN CompanyManagementDetail p ON pu.Id = p.PersonaUserId JOIN CompanyInfo c ON p.CompanyInfoId = c.Id JOIN LookUpValue d ON p.DepartmentId = d.Id WHERE pm.Article IS NOT NULL AND pm.Article != '' AND pm.Article != '{\"Articles\":[]}' GROUP BY p.Name, c.Name, d.Value ORDER BY COUNT(pm.Id) DESC;",
  "What is the yearly trend of Twitter activity (likes and retweets) for 'G-XChange Inc.'? (CompanyTwitterDetail, CompanyInfo)": "SELECT YEAR(ctd.TwitterDate) AS ActivityYear, SUM(ctd.Likes) AS TotalLikes, SUM(ctd.Reposts) AS TotalRetweets FROM CompanyTwitterDetail ctd JOIN CompanyInfo ci ON ctd.CompanyInfoId = ci.Id WHERE ci.Name = 'G-XChange Inc.' GROUP BY YEAR(ctd.TwitterDate) ORDER BY ActivityYear DESC;"
}